[
 {
    "private": false,
    "updated": "2023-07-18T09:23:01Z",
    "name": "Miles Davis",
    "extract": "Miles Dewey Davis III (May 26, 1926 – September 28, 1991) was an American jazz trumpeter, bandleader, and composer. He is among the most influential and acclaimed figures in the history of jazz and 20th-century music. Davis adopted a variety of musical directions in a roughly five-decade career that kept him at the forefront of many major stylistic developments in jazz.Born into a upper-middle-class family in Alton, Illinois, and raised in East St. Louis, Davis started on the trumpet in his early teens. He left to study at Juilliard in New York City, before dropping out and making his professional debut as a member of saxophonist Charlie Parker's bebop quintet from 1944 to 1948. Shortly after, he recorded the Birth of the Cool sessions for Capitol Records, which were instrumental to the development of cool jazz. In the early 1950s, Davis recorded some of the earliest hard bop music while on Prestige Records but did so haphazardly due to a heroin addiction. After a widely acclaimed comeback performance at the Newport Jazz Festival, he signed a long-term contract with Columbia Records, and recorded the album 'Round About Midnight in 1955. It was his first work with saxophonist John Coltrane and bassist Paul Chambers, key members of the sextet he led into the early 1960s. During this period, he alternated between orchestral jazz collaborations with arranger Gil Evans, such as the Spanish music-influenced Sketches of Spain (1960), and band recordings, such as Milestones (1958) and Kind of Blue (1959). The latter recording remains one of the most popular jazz albums of all time, having sold over five million copies in the U.S.\nDavis made several lineup changes while recording Someday My Prince Will Come (1961), his 1961 Blackhawk concerts, and Seven Steps to Heaven (1963), another commercial success that introduced bassist Ron Carter, pianist Herbie Hancock, and drummer Tony Williams. After adding saxophonist Wayne Shorter to his new quintet in 1964, Davis led them on a series of more abstract recordings often composed by the band members, helping pioneer the post-bop genre with albums such as E.S.P. (1965) and Miles Smiles (1967), before transitioning into his electric period. During the 1970s, he experimented with rock, funk, African rhythms, emerging electronic music technology, and an ever-changing lineup of musicians, including keyboardist Joe Zawinul, drummer Al Foster, and guitarist John McLaughlin. This period, beginning with Davis's 1969 studio album In a Silent Way and concluding with the 1975 concert recording Agharta, was the most controversial in his career, alienating and challenging many in jazz. His million-selling 1970 record Bitches Brew helped spark a resurgence in the genre's commercial popularity with jazz fusion as the decade progressed.After a five-year retirement due to poor health, Davis resumed his career in the 1980s, employing younger musicians and pop sounds on albums such as The Man with the Horn (1981) and Tutu (1986). Critics were often unreceptive but the decade garnered Davis his highest level of commercial recognition. He performed sold-out concerts worldwide, while branching out into visual arts, film, and television work, before his death in 1991 from the combined effects of a stroke, pneumonia and respiratory failure. In 2006, Davis was inducted into the Rock and Roll Hall of Fame, which recognized him as \"one of the key figures in the history of jazz\". Rolling Stone described him as \"the most revered jazz trumpeter of all time, not to mention one of the most important musicians of the 20th century,\" while Gerald Early called him inarguably one of the most influential and innovative musicians of that period."
 },
 {
    "private": false,
    "updated": "2023-07-18T09:23:01Z",
    "name": "Duke Ellington",
    "extract": "Edward Kennedy \"Duke\" Ellington (April 29, 1899 – May 24, 1974) was an American jazz pianist, composer, and leader of his eponymous jazz orchestra from 1923 through the rest of his life.Born and raised in Washington, D.C., Ellington was based in New York City from the mid-1920s and gained a national profile through his orchestra's appearances at the Cotton Club in Harlem. A master at writing miniatures for the three-minute 78 rpm recording format, Ellington wrote or collaborated on more than one thousand compositions; his extensive body of work is the largest recorded personal jazz legacy, and many of his pieces have become standards. He also recorded songs written by his bandsmen, such as Juan Tizol's \"Caravan\", which brought a Spanish tinge to big band jazz.\nAt the end of the 1930s, Ellington began a nearly thirty-year collaboration with composer-arranger-pianist Billy Strayhorn, whom he called his writing and arranging companion. With Strayhorn, he composed multiple extended compositions, or suites, as well as many short pieces. For a few years at the beginning of Strayhorn's involvement, Ellington's orchestra featured bassist Jimmy Blanton and tenor saxophonist Ben Webster and reached a creative peak. Some years later following a low-profile period, an appearance by Ellington and his orchestra at the Newport Jazz Festival in July 1956 led to a major revival and regular world tours. Ellington recorded for most American record companies of his era, performed in and scored several films, and composed a handful of stage musicals.\nAlthough a pivotal figure in the history of jazz, in the opinion of Gunther Schuller and Barry Kernfeld, \"the most significant composer of the genre\", Ellington himself embraced the phrase \"beyond category\", considering it a liberating principle, and referring to his music as part of the more general category of American Music. Ellington was known for his inventive use of the orchestra, or big band, as well as for his eloquence and charisma. He was awarded a posthumous Pulitzer Prize Special Award for music in 1999."
 },
 {
    "private": false,
    "updated": "2023-07-18T09:23:01Z",
    "name": "Oscar Peterson",
    "extract": "Oscar Emmanuel Peterson  (August 15, 1925 – December 23, 2007) was a Canadian jazz pianist and composer. Considered a virtuoso and one of the greatest jazz pianists of all time, Peterson released more than 200 recordings, won eight Grammy Awards, as well as a lifetime achievement award from the Recording Academy, and received numerous other awards and honours. He played thousands of concerts worldwide in a career lasting more than 60 years. He was called the \"Maharaja of the keyboard\" by Duke Ellington, simply \"O.P.\" by his friends, and informally in the jazz community, \"the King of inside swing\".\nPeterson worked in duos with Sam Jones, Niels-Henning Ørsted Pedersen, Joe Pass, Irving Ashby, Count Basie,  and Herbie Hancock. He considered the trio with Ray Brown and Herb Ellis \"the most stimulating\" and productive setting for public performances and studio recordings. In the early 1950s, he began performing with Brown and drummer Charlie Smith as the Oscar Peterson Trio. Shortly afterward Smith was replaced by guitarist Irving Ashby, who had been a member of the Nat King Cole Trio. Ashby, who was a swing guitarist, was soon replaced by Kessel. Their last recording, On the Town with the Oscar Peterson Trio, recorded live at the Town Tavern in Toronto, captured a remarkable degree of emotional as well as musical understanding among three players.Peterson won eight Grammy Awards during his lifetime between 1975 and 1997. He is considered among the best jazz pianists and jazz improvisers of the twentieth century.\n\n"
 },
 {
    "private": false,
    "updated": "2023-07-18T09:23:01Z",
    "name": "Count Basie",
    "extract": "William James \"Count\" Basie (; August 21, 1904 – April 26, 1984) was an American jazz pianist, organist, bandleader, and composer. In 1935, he formed the Count Basie Orchestra, and in 1936 took them to Chicago for a long engagement and their first recording. He led the group for almost 50 years, creating innovations like the use of two \"split\" tenor saxophones, emphasizing the rhythm section, riffing with a big band, using arrangers to broaden their sound, and others. Many musicians came to prominence under his direction, including the tenor saxophonists Lester Young and Herschel Evans, the guitarist Freddie Green, trumpeters Buck Clayton and Harry \"Sweets\" Edison, plunger trombonist Al Grey, and singers Jimmy Rushing, Helen Humes, Thelma Carpenter, and Joe Williams."
 }
]